InformationRegisters/ХарактеристикиОбъектовПоМедРегистру.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ХарактеристикиОбъектовПоМедРегистру</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКлассификаторовМедРегистра</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УченыеСтепени</v8:Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:EnumRef.СостоянияСотрудника</v8:Type>
						<v8:Type>cfg:EnumRef.ОтношениеКВоинскойОбязанности</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
						<v8:Type>cfg:CatalogRef.Награды</v8:Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольнения</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьОснованияУвольнения</v8:Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
						<v8:Type>cfg:EnumRef.КатегорииДолжностейДляСтатистическогоУчета</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбразованиеФизическихЛиц</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыОбразованияФизическихЛиц</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыКадровыхСобытий</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятости</v8:Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
						<v8:Type>cfg:CatalogRef.СостояниеВБраке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Классификатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМедРегистра</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Должности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Должности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВвода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключенаИзШтатногоРасписания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВведенаВШтатноеРасписание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяДолжностьюЛетногоЭкипажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяШахтерскойДолжностью</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяФармацевтическойДолжностью</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДосрочногоНазначенияПенсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияДосрочногоНазначенияПенсии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОснованиеДосрочногоНазначенияПенсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьОснованияДосрочногоНазначенияПенсии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРаботСДосрочнойПенсией</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияВоинскогоУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииДолжностейДляВоинскогоУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияУчетаЗабронированных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииДолжностейДляУчетаЗабронированных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛетноПодъемныйСостав</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плавсостав</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтрокаОтчетностиМониторингаРаботниковСоциальнойСферы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеУсловияТрудаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТрудаПФР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОсобыеУсловияТрудаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьОсобыеУсловияТрудаПФР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПозицииСпискаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКраткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяСетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрядКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяСеткаНадбавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрядКатегорияНадбавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНадбавкиЗаВредность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплачиваетсяНадбавкаЗаВредность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейДополнительногоОтпускаВГод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКПДТРКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКПДТРКЧ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКПДТРКатегория</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКЗКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерВыполняемыхРаботПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныеДокументыПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрудоваяФункция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТрудовыеФункции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляЗаписейОТрудовойДеятельности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботаСКоронавирусом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтажаЛетныхЭкипажей</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтажаЛетныхЭкипажей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтажаШахтеров</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтажаШахтеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяДолжностьюЕдиноличногоРуководителяКоммерческойОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Специальности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Специальность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗависимыеСтажи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСтажа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыСтажа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ХарактеристикиОбъектовПоМедРегистру/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПодключаемыеХарактеристикиДолжностей(Замещение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьПодключаемыеХарактеристикиДолжностей(Замещение)
	
	ОтборНаборов = РегистрыБЗК.ОтборыЗаписейНабора(ЭтотОбъект, Замещение);

	ОтборОбъект = Неопределено;
	ОтборКлассификатор = Неопределено;
	
	Для Каждого ОтборНабора Из ОтборНаборов Цикл
		
		Если ОтборНабора["Объект_Использование"] Тогда
			ОтборОбъект = ОтборНабора["Объект"];
		КонецЕсли;
		
		Если Не ОтборНабора["Классификатор_Использование"] Тогда
			ОтборКлассификатор = ОтборНабора["Классификатор"];
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ОтборОбъект) И ТипЗнч(ОтборОбъект) <> Тип("СправочникСсылка.Должности") Тогда
		Возврат;
	КонецЕсли;

	ХарактеристикиДолжности = РегистрыСведений.ХарактеристикиОбъектовПоМедРегистру.ХарактеристикиОбъектаМетаданныхДляРегистра(Тип("СправочникСсылка.Должности"));
	ПредставленияХарактеристик = Новый Соответствие;
	Для Каждого ХарактеристикаДолжности Из ХарактеристикиДолжности Цикл
		ПредставленияХарактеристик.Вставить(ХарактеристикаДолжности.Классификатор, ХарактеристикаДолжности.ПредставлениеХарактеристики);
	КонецЦикла;

	Если ЗначениеЗаполнено(ОтборКлассификатор) И ПредставленияХарактеристик[ОтборКлассификатор] = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборОбъект) Или ЗначениеЗаполнено(ОтборКлассификатор) Тогда
		
		ПодключаемыеХарактеристики = Выгрузить();
		ПодключаемыеХарактеристики.Колонки.Добавить("Свойство", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
		ПодключаемыеХарактеристики.Колонки.Добавить("ИдентификаторИсточника", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
		Для Каждого ХарактеристикаДолжности Из ПодключаемыеХарактеристики Цикл
			ХарактеристикаДолжности.Свойство = ПредставленияХарактеристик[ХарактеристикаДолжности.Классификатор];
			ХарактеристикаДолжности.ИдентификаторИсточника = "НСИФРМР";
		КонецЦикла;
		
		ПодключаемыеХарактеристики.Колонки.Удалить("Классификатор");
		ПодключаемыеХарактеристики.Колонки.Характеристика.Имя = "Значение";
		
		Если ЗначениеЗаполнено(ОтборКлассификатор) Тогда
			// дополним таблицу недостающими характеристиками
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПредставленияХарактеристик.Классификатор,
			|	ПредставленияХарактеристик.ПредставлениеХарактеристики КАК ПредставлениеКлассификатора
			|ПОМЕСТИТЬ ВТПредставленияХарактеристик
			|ИЗ
			|	&ПредставленияХарактеристик КАК ПредставленияХарактеристик
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.Объект,
			|	ВТ.Свойство,
			|	ВТ.Значение
			|ПОМЕСТИТЬ ВТПодключаемыеХарактеристики
			|ИЗ
			|	&ПодключаемыеХарактеристики КАК ВТ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ХарактеристикиОбъектовПоМедРегистру.Объект,
			|	ХарактеристикиОбъектовПоМедРегистру.Классификатор,
			|	ХарактеристикиОбъектовПоМедРегистру.Характеристика
			|ПОМЕСТИТЬ ВТНаборЗаписей
			|ИЗ
			|	РегистрСведений.ХарактеристикиОбъектовПоМедРегистру КАК ХарактеристикиОбъектовПоМедРегистру
			|ГДЕ
			|	ХарактеристикиОбъектовПоМедРегистру.Объект В
			|			(ВЫБРАТЬ
			|				Отбор.Объект
			|			ИЗ
			|				ВТПодключаемыеХарактеристики КАК Отбор)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТНаборЗаписей.Объект,
			|	ВТПредставленияХарактеристик.ПредставлениеКлассификатора КАК Свойство,
			|	ВТНаборЗаписей.Характеристика КАК Значение,
			|	1 КАК Индекс
			|ПОМЕСТИТЬ ВТВсеЗаписи
			|ИЗ
			|	ВТНаборЗаписей КАК ВТНаборЗаписей
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПредставленияХарактеристик КАК ВТПредставленияХарактеристик
			|		ПО ВТНаборЗаписей.Классификатор = ВТПредставленияХарактеристик.Классификатор
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВТПодключаемыеХарактеристики.Объект,
			|	ВТПодключаемыеХарактеристики.Свойство,
			|	ВТПодключаемыеХарактеристики.Значение,
			|	0
			|ИЗ
			|	ВТПодключаемыеХарактеристики КАК ВТПодключаемыеХарактеристики
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТВсеЗаписи.Объект,
			|	ВТВсеЗаписи.Свойство,
			|	МИНИМУМ(ВТВсеЗаписи.Индекс) КАК Индекс
			|ПОМЕСТИТЬ ВТИндексы
			|ИЗ
			|	ВТВсеЗаписи КАК ВТВсеЗаписи
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТВсеЗаписи.Объект,
			|	ВТВсеЗаписи.Свойство
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
		    |	""НСИФРМР"" КАК ИдентификаторИсточника,
			|	ВТВсеЗаписи.Объект,
			|	ВТВсеЗаписи.Свойство,
			|	ВТВсеЗаписи.Значение
			|ИЗ
			|	ВТВсеЗаписи КАК ВТВсеЗаписи
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИндексы КАК ВТИндексы
			|		ПО ВТВсеЗаписи.Объект = ВТИндексы.Объект
			|			И ВТВсеЗаписи.Свойство = ВТИндексы.Свойство
			|			И ВТВсеЗаписи.Индекс = ВТИндексы.Индекс";
			Запрос.УстановитьПараметр("ПредставленияХарактеристик", ХарактеристикиДолжности);
			Запрос.УстановитьПараметр("ПодключаемыеХарактеристики", ПодключаемыеХарактеристики);
			
			ПодключаемыеХарактеристики = Запрос.Выполнить().Выгрузить();
		КонецЕсли;
		
		РегистрыСведений.ХарактеристикиОбъектовПоМедРегистру.ОбновитьПодключаемыеХарактеристики(Истина, ПодключаемыеХарактеристики, ОтборОбъект);
		
	ИначеЕсли Количество() = 0 И НЕ РегистрыБЗК.ЭтоУдалениеНабораЗаписей(Замещение) Тогда
		РегистрыСведений.ХарактеристикиОбъектовПоМедРегистру.ОбновитьПодключаемыеХарактеристики(Истина, Новый ТаблицаЗначений);
	Иначе
		МассивОбъектов = ВыгрузитьКолонку("Объект");
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Объекты", МассивОбъектов);
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Должности.Ссылка
		|ИЗ
		|	Справочник.Должности КАК Должности
		|ГДЕ
		|	Должности.Ссылка В(&Объекты)";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПредставленияХарактеристик.Классификатор,
			|	ПредставленияХарактеристик.ПредставлениеХарактеристики КАК ПредставлениеКлассификатора
			|ПОМЕСТИТЬ ВТПредставленияХарактеристик
			|ИЗ
			|	&ПредставленияХарактеристик КАК ПредставленияХарактеристик
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ХарактеристикиОбъектовПоМедРегистру.Объект,
			|	ХарактеристикиОбъектовПоМедРегистру.Классификатор,
			|	ХарактеристикиОбъектовПоМедРегистру.Характеристика
			|ПОМЕСТИТЬ ВТНаборЗаписей
			|ИЗ
			|	&НаборЗаписей КАК ХарактеристикиОбъектовПоМедРегистру
			|ГДЕ
			|	ТИПЗНАЧЕНИЯ(ХарактеристикиОбъектовПоМедРегистру.Объект) = ТИП(Справочник.Должности)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
		    |	""НСИФРМР"" КАК ИдентификаторИсточника,
			|	ВТНаборЗаписей.Объект,
			|	ВТПредставленияХарактеристик.ПредставлениеКлассификатора КАК Свойство,
			|	ВТНаборЗаписей.Характеристика КАК Значение
			|ИЗ
			|	ВТНаборЗаписей КАК ВТНаборЗаписей
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПредставленияХарактеристик КАК ВТПредставленияХарактеристик
			|		ПО ВТНаборЗаписей.Классификатор = ВТПредставленияХарактеристик.Классификатор";
			Запрос.УстановитьПараметр("ПредставленияХарактеристик", ХарактеристикиДолжности);
			Запрос.УстановитьПараметр("НаборЗаписей", ЭтотОбъект);
			
			РегистрыСведений.ХарактеристикиОбъектовПоМедРегистру.ОбновитьПодключаемыеХарактеристики(Истина,  Запрос.Выполнить().Выгрузить());
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
	
#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
